# NoTypeParamsDefinedWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..NoTypeParamsDefinedWarning Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
The parameters of the default type have no values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoTypeParamsDefinedWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoTypeParamsDefinedWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoTypeParamsDefinedWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace